---
kind: type
id: T:Autodesk.Revit.DB.PointClouds.PointCloudFilterFactory
source: html/fcbc90c3-0a9d-7522-e483-cad73468d698.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudFilterFactory

A factory class for creating point cloud filters.

## Syntax (C#)
```csharp
public static class PointCloudFilterFactory
```